Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/svd/PIC32CX1025MTSH128.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="CMCC0">
         <name>CMCC1</name>
         <baseAddress>0x4600C000</baseAddress>
      </peripheral>
      <peripheral>
         <name>CPKCC</name>
         <version>44163B</version>
         <description>Classic Public Key Cryptography Controller</description>
         <baseAddress>0x46000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xFC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>CPKCC</name>
            <value>59</value>
         </interrupt>
         <registers>
            <register>
               <name>R</name>
               <description>R Parameter Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_R value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>X</name>
               <description>X Parameter Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_X value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>Y</name>
               <description>Y Parameter Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_Y value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>Z</name>
               <description>Z Parameter Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_Z value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>J</name>
               <description>J Parameter Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_J value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>K</name>
               <description>K Parameter Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_K value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>N</name>
               <description>N Parameter Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_N value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMULA</name>
               <description>SMULA Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_SMULA value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMULB</name>
               <description>SMULB Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_SMULB value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMULRL</name>
               <description>SMULRL Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_SMULRL value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SMULRH</name>
               <description>SMULRH Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_SMULRH value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDLE</name>
               <description>IDLE Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_IDLE value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IDLECACHE</name>
               <description>IDLECACHE Register</description>
               <addressOffset>0x2D</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_IDLECACHE value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR_C</name>
               <description>CR_C Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_CR_C value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR_S</name>
               <description>CR_S Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_CR_S value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <description>CR Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GF2N</name>
                     <description>GF(2n) mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CARRYIN</name>
                     <description>CARRYIN value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONEMUL</name>
                     <description>ONEMUL value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABORT</name>
                     <description>ABORT value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPILLW</name>
                     <description>Spill Word register bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AWAKE</name>
                     <description>AWAKE value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PKCCIRQ</name>
                     <description>CPKCC_IRQ value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ITEN</name>
                     <description>ITEN value</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRRAM</name>
                     <description>CLRRAM value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_CR value</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>23</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OR</name>
               <description>Operation Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CMD0</name>
                     <description>CMD0 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMD1</name>
                     <description>CMD1 value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMD2</name>
                     <description>CMD2 value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMD3</name>
                     <description>CMD3 value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTM0</name>
                     <description>OPTM0 value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTM1</name>
                     <description>OPTM1 value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTC0</name>
                     <description>OPTC0 value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPTC1</name>
                     <description>OPTC1 value</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CARRYMUL</name>
                     <description>CARRYMUL value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_OR value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>21</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <description>SR Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CACHE</name>
                     <description>CACHE value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CARRY</name>
                     <description>CARRY value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ZERO</name>
                     <description>ZERO value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RAMV</name>
                     <description>RAM violation</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHAREV</name>
                     <description>SHAREV value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLRRAM_BUSY</name>
                     <description>CLRRAM_BUSY value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_SR value</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>25</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDRSIZE</name>
               <description>ADDRSIZE Register</description>
               <addressOffset>0xEC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_ADDRSIZE value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>IPNAME[%s]</name>
               <description>IPNAME1 Register</description>
               <addressOffset>0xF0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_IPNAME1 value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FEATURES</name>
               <description>FEATURES Register</description>
               <addressOffset>0xF8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>CPKCC_FEATURES value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
