Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTSH/svd/PIC32CX1025MTSH128.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="IPC0">
         <name>IPC1</name>
         <baseAddress>0x48014000</baseAddress>
         <interrupt>
            <name>IPC1</name>
            <value>88</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>MATRIX0</name>
         <version>6342J</version>
         <description>AHB Bus Matrix</description>
         <groupName>MATRIX</groupName>
         <prependToName>MATRIX_</prependToName>
         <baseAddress>0x46004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x2CC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>MATRIX0</name>
            <value>60</value>
         </interrupt>
         <registers>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>MCFG[%s]</name>
               <description>Master Configuration Register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ULBT</name>
                     <description>Undefined Length Burst Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>ULBTSelect</name>
                        <enumeratedValue>
                           <name>UNLIMITED</name>
                           <description>Unlimited Length Burst-No predicted end of burst is generated, therefore INCR bursts coming from this master can only be broken if the Slave Slot Cycle Limit is reached. If the Slot Cycle Limit is not reached, the burst is normally completed by the master, at the latest, on the next system bus 1 Kbyte address boundary, allowing up to 256-beat word bursts or 128-beat double-word bursts. This value should not be used in the very particular case of a master capable of performing back-to-back undefined length bursts on a single slave, since this could indefinitely freeze the slave arbitration and thus prevent another master from accessing this slave.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single Access-The undefined length burst is treated as a succession of single accesses, allowing re-arbitration at each beat of the INCR burst or bursts sequence.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_4_BEAT</name>
                           <description>4-beat Burst-The undefined length burst or bursts sequence is split into 4-beat bursts or less, allowing re-arbitration every 4 beats.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_8_BEAT</name>
                           <description>8-beat Burst-The undefined length burst or bursts sequence is split into 8-beat bursts or less, allowing re-arbitration every 8 beats.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BEAT</name>
                           <description>16-beat Burst-The undefined length burst or bursts sequence is split into 16-beat bursts or less, allowing re-arbitration every 16 beats.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BEAT</name>
                           <description>32-beat Burst-The undefined length burst or bursts sequence is split into 32-beat bursts or less, allowing re-arbitration every 32 beats.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BEAT</name>
                           <description>64-beat Burst-The undefined length burst or bursts sequence is split into 64-beat bursts or less, allowing re-arbitration every 64 beats.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128_BEAT</name>
                           <description>128-beat Burst-The undefined length burst or bursts sequence is split into 128-beat bursts or less, allowing re-arbitration every 128 beats. Unless duly needed, the ULBT should be left at its default 0 value for power saving.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>SCFG[%s]</name>
               <description>Slave Configuration Register</description>
               <addressOffset>0x0040</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SLOT_CYCLE</name>
                     <description>Maximum Bus Grant Duration for Masters</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>DEFMSTR_TYPE</name>
                     <description>Default Master Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEFMSTR_TYPESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters. This results in a one clock cycle latency for the first access of a burst transfer or for a single access.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST</name>
                           <description>Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it. This results in not having one clock cycle latency when the last master tries to access the slave again.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIXED</name>
                           <description>Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field. This results in not having one clock cycle latency when the fixed master tries to access the slave again.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXED_DEFMSTR</name>
                     <description>Fixed Default Master</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>16</dim>
               <dimIncrement>8</dimIncrement>
               <name>MATRIX_PR[%s]</name>
               <description/>
               <addressOffset>0x0080</addressOffset>
               <register>
                  <name>PRAS</name>
                  <description>Priority Register A for Slave 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>M0PR</name>
                        <description>Master 0 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN0</name>
                        <description>Latency Quality of Service Enable for Master 0</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M1PR</name>
                        <description>Master 1 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN1</name>
                        <description>Latency Quality of Service Enable for Master 1</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M2PR</name>
                        <description>Master 2 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN2</name>
                        <description>Latency Quality of Service Enable for Master 2</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M3PR</name>
                        <description>Master 3 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN3</name>
                        <description>Latency Quality of Service Enable for Master 3</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M4PR</name>
                        <description>Master 4 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN4</name>
                        <description>Latency Quality of Service Enable for Master 4</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M5PR</name>
                        <description>Master 5 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN5</name>
                        <description>Latency Quality of Service Enable for Master 5</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M6PR</name>
                        <description>Master 6 Priority</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN6</name>
                        <description>Latency Quality of Service Enable for Master 6</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M7PR</name>
                        <description>Master 7 Priority</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN7</name>
                        <description>Latency Quality of Service Enable for Master 7</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PRBS</name>
                  <description>Priority Register B for Slave 0</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>M8PR</name>
                        <description>Master 8 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN8</name>
                        <description>Latency Quality of Service Enable for Master 8</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M9PR</name>
                        <description>Master 9 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN9</name>
                        <description>Latency Quality of Service Enable for Master 9</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M10PR</name>
                        <description>Master 10 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN10</name>
                        <description>Latency Quality of Service Enable for Master 10</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M11PR</name>
                        <description>Master 11 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN11</name>
                        <description>Latency Quality of Service Enable for Master 11</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M12PR</name>
                        <description>Master 12 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN12</name>
                        <description>Latency Quality of Service Enable for Master 12</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M13PR</name>
                        <description>Master 13 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN13</name>
                        <description>Latency Quality of Service Enable for Master 13</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M14PR</name>
                        <description>Master 14 Priority</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN14</name>
                        <description>Latency Quality of Service Enable for Master 14</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M15PR</name>
                        <description>Master 15 Priority</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN15</name>
                        <description>Latency Quality of Service Enable for Master 15</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>MRCR</name>
               <description>Master Remap Control Register</description>
               <addressOffset>0x0100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RCB0</name>
                     <description>Remap Command Bit for Master 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB1</name>
                     <description>Remap Command Bit for Master 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB2</name>
                     <description>Remap Command Bit for Master 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB3</name>
                     <description>Remap Command Bit for Master 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB4</name>
                     <description>Remap Command Bit for Master 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB5</name>
                     <description>Remap Command Bit for Master 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB6</name>
                     <description>Remap Command Bit for Master 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB7</name>
                     <description>Remap Command Bit for Master 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB8</name>
                     <description>Remap Command Bit for Master 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB9</name>
                     <description>Remap Command Bit for Master 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB10</name>
                     <description>Remap Command Bit for Master 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB11</name>
                     <description>Remap Command Bit for Master 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB12</name>
                     <description>Remap Command Bit for Master 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB13</name>
                     <description>Remap Command Bit for Master 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB14</name>
                     <description>Remap Command Bit for Master 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RCB15</name>
                     <description>Remap Command Bit for Master 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>SFR[%s]</name>
               <description>Special Function Register</description>
               <addressOffset>0x0110</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register Fields</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
